experiment-data/k3s/dp_redis_density/dp_redis_density/2022-10-07T13-49-53/kbench-pod-oid-0-tid-1/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          940.84          ---          ---        19.27313        15.87100        96.76700       172.03100        72.48 
Gets         9406.62         1.00      9405.62        19.29707        15.87100        96.25500       171.00700       366.46 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      10347.46         1.00      9405.62        19.29489        15.87100        96.25500       171.00700       438.93 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.255        0.000
SET       2.799        5.000
SET       5.599       10.000
SET       7.583       15.000
SET       9.087       20.000
SET      10.303       25.000
SET      11.391       30.000
SET      12.415       35.000
SET      13.503       40.000
SET      14.655       45.000
SET      15.871       50.000
SET      16.511       52.500
SET      17.151       55.000
SET      17.791       57.500
SET      18.431       60.000
SET      19.199       62.500
SET      19.967       65.000
SET      20.863       67.500
SET      21.631       70.000
SET      22.655       72.500
SET      23.551       75.000
SET      24.063       76.250
SET      24.703       77.500
SET      25.215       78.750
SET      25.855       80.000
SET      26.495       81.250
SET      27.263       82.500
SET      28.031       83.750
SET      28.927       85.000
SET      29.823       86.250
SET      30.847       87.500
SET      31.359       88.125
SET      31.999       88.750
SET      32.639       89.375
SET      33.279       90.000
SET      34.047       90.625
SET      35.071       91.250
SET      35.839       91.875
SET      36.863       92.500
SET      38.143       93.125
SET      39.679       93.750
SET      40.447       94.062
SET      41.215       94.375
SET      42.239       94.688
SET      43.263       95.000
SET      44.287       95.312
SET      45.823       95.625
SET      47.103       95.938
SET      48.895       96.250
SET      50.943       96.562
SET      53.503       96.875
SET      54.783       97.031
SET      56.575       97.188
SET      58.111       97.344
SET      59.903       97.500
SET      62.207       97.656
SET      64.511       97.812
SET      67.583       97.969
SET      70.655       98.125
SET      74.239       98.281
SET      78.335       98.438
SET      80.383       98.516
SET      82.431       98.594
SET      84.991       98.672
SET      87.551       98.750
SET      90.111       98.828
SET      93.183       98.906
SET      95.743       98.984
SET      99.327       99.062
SET     102.399       99.141
SET     105.983       99.219
SET     108.031       99.258
SET     110.591       99.297
SET     113.151       99.336
SET     115.199       99.375
SET     117.759       99.414
SET     119.807       99.453
SET     122.367       99.492
SET     125.439       99.531
SET     128.511       99.570
SET     132.095       99.609
SET     133.119       99.629
SET     135.167       99.648
SET     137.215       99.668
SET     139.263       99.688
SET     141.311       99.707
SET     143.359       99.727
SET     145.407       99.746
SET     147.455       99.766
SET     150.527       99.785
SET     153.599       99.805
SET     155.647       99.814
SET     156.671       99.824
SET     157.695       99.834
SET     159.743       99.844
SET     160.767       99.854
SET     163.839       99.863
SET     164.863       99.873
SET     166.911       99.883
SET     169.983       99.893
SET     172.031       99.902
SET     174.079       99.907
SET     175.103       99.912
SET     177.151       99.917
SET     178.175       99.922
SET     180.223       99.927
SET     182.271       99.932
SET     184.319       99.937
SET     186.367       99.941
SET     189.439       99.946
SET     192.511       99.951
SET     194.559       99.954
SET     196.607       99.956
SET     196.607       99.958
SET     198.655       99.961
SET     200.703       99.963
SET     201.727       99.966
SET     202.751       99.968
SET     204.799       99.971
SET     207.871       99.973
SET     209.919       99.976
SET     211.967       99.977
SET     214.015       99.978
SET     215.039       99.979
SET     216.063       99.980
SET     217.087       99.982
SET     218.111       99.983
SET     219.135       99.984
SET     221.183       99.985
SET     223.231       99.987
SET     224.255       99.988
SET     225.279       99.988
SET     226.303       99.989
SET     227.327       99.990
SET     229.375       99.990
SET     230.399       99.991
SET     232.447       99.991
SET     232.447       99.992
SET     233.471       99.993
SET     233.471       99.993
SET     235.519       99.994
SET     235.519       99.994
SET     235.519       99.995
SET     236.543       99.995
SET     236.543       99.995
SET     236.543       99.995
SET     236.543       99.996
SET     237.567       99.996
SET     240.639       99.996
SET     240.639       99.997
SET     241.663       99.997
SET     243.711       99.997
SET     249.855       99.997
SET     250.879       99.997
SET     250.879       99.998
SET     250.879       99.998
SET     250.879       99.998
SET     252.927       99.998
SET     253.951       99.998
SET     254.975       99.998
SET     254.975       99.998
SET     254.975       99.999
SET     254.975       99.999
SET     254.975       99.999
SET     264.191       99.999
SET     264.191       99.999
SET     264.191       99.999
SET     266.239       99.999
SET     266.239       99.999
SET     270.335       99.999
SET     270.335       99.999
SET     270.335       99.999
SET     272.383       99.999
SET     272.383       99.999
SET     272.383       99.999
[...]
SET     274.431      100.000
SET     274.431      100.000
SET     274.431      100.000
[...]
SET     284.671      100.000
SET     284.671      100.000
SET     284.671      100.000
[...]
SET     290.815      100.000
SET     290.815      100.000
---
GET       0.255        0.000
GET       2.815        5.000
GET       5.599       10.000
GET       7.583       15.000
GET       9.087       20.000
GET      10.303       25.000
GET      11.391       30.000
GET      12.415       35.000
GET      13.503       40.000
GET      14.655       45.000
GET      15.871       50.000
GET      16.511       52.500
GET      17.151       55.000
GET      17.791       57.500
GET      18.559       60.000
GET      19.199       62.500
GET      20.095       65.000
GET      20.863       67.500
GET      21.759       70.000
GET      22.655       72.500
GET      23.679       75.000
GET      24.063       76.250
GET      24.703       77.500
GET      25.215       78.750
GET      25.855       80.000
GET      26.623       81.250
GET      27.263       82.500
GET      28.031       83.750
GET      28.927       85.000
GET      29.823       86.250
GET      30.847       87.500
GET      31.359       88.125
GET      31.999       88.750
GET      32.639       89.375
GET      33.279       90.000
GET      34.047       90.625
GET      35.071       91.250
GET      36.095       91.875
GET      37.119       92.500
GET      38.399       93.125
GET      39.935       93.750
GET      40.703       94.062
GET      41.471       94.375
GET      42.495       94.688
GET      43.519       95.000
GET      44.543       95.312
GET      45.823       95.625
GET      47.615       95.938
GET      49.151       96.250
GET      51.199       96.562
GET      53.759       96.875
GET      55.039       97.031
GET      56.831       97.188
GET      58.367       97.344
GET      60.415       97.500
GET      62.463       97.656
GET      64.767       97.812
GET      68.095       97.969
GET      70.655       98.125
GET      74.239       98.281
GET      78.335       98.438
GET      80.383       98.516
GET      82.431       98.594
GET      84.991       98.672
GET      87.551       98.750
GET      89.599       98.828
GET      92.671       98.906
GET      95.743       98.984
GET      98.815       99.062
GET     102.399       99.141
GET     105.983       99.219
GET     108.031       99.258
GET     110.079       99.297
GET     112.639       99.336
GET     115.199       99.375
GET     117.247       99.414
GET     119.807       99.453
GET     122.367       99.492
GET     125.439       99.531
GET     127.999       99.570
GET     131.071       99.609
GET     133.119       99.629
GET     135.167       99.648
GET     137.215       99.668
GET     139.263       99.688
GET     141.311       99.707
GET     143.359       99.727
GET     145.407       99.746
GET     147.455       99.766
GET     150.527       99.785
GET     152.575       99.805
GET     154.623       99.814
GET     156.671       99.824
GET     157.695       99.834
GET     159.743       99.844
GET     161.791       99.854
GET     162.815       99.863
GET     164.863       99.873
GET     166.911       99.883
GET     168.959       99.893
GET     172.031       99.902
GET     173.055       99.907
GET     175.103       99.912
GET     176.127       99.917
GET     178.175       99.922
GET     179.199       99.927
GET     181.247       99.932
GET     183.295       99.937
GET     185.343       99.941
GET     188.415       99.946
GET     191.487       99.951
GET     193.535       99.954
GET     194.559       99.956
GET     195.583       99.958
GET     197.631       99.961
GET     198.655       99.963
GET     200.703       99.966
GET     202.751       99.968
GET     204.799       99.971
GET     205.823       99.973
GET     207.871       99.976
GET     208.895       99.977
GET     210.943       99.978
GET     211.967       99.979
GET     212.991       99.980
GET     215.039       99.982
GET     217.087       99.983
GET     218.111       99.984
GET     220.159       99.985
GET     222.207       99.987
GET     224.255       99.988
GET     225.279       99.988
GET     225.279       99.989
GET     226.303       99.990
GET     227.327       99.990
GET     228.351       99.991
GET     230.399       99.991
GET     231.423       99.992
GET     232.447       99.993
GET     234.495       99.993
GET     235.519       99.994
GET     235.519       99.994
GET     236.543       99.995
GET     237.567       99.995
GET     239.615       99.995
GET     240.639       99.995
GET     241.663       99.996
GET     243.711       99.996
GET     244.735       99.996
GET     246.783       99.997
GET     249.855       99.997
GET     250.879       99.997
GET     251.903       99.997
GET     252.927       99.997
GET     253.951       99.998
GET     254.975       99.998
GET     254.975       99.998
GET     255.999       99.998
GET     257.023       99.998
GET     259.071       99.998
GET     260.095       99.998
GET     261.119       99.999
GET     266.239       99.999
GET     266.239       99.999
GET     270.335       99.999
GET     270.335       99.999
GET     270.335       99.999
[...]
GET     272.383       99.999
GET     274.431       99.999
GET     274.431       99.999
GET     280.575       99.999
GET     280.575       99.999
GET     282.623       99.999
GET     284.671       99.999
GET     284.671       99.999
GET     286.719      100.000
GET     288.767      100.000
GET     288.767      100.000
GET     288.767      100.000
[...]
GET     290.815      100.000
GET     290.815      100.000
GET     290.815      100.000
[...]
GET     292.863      100.000
GET     292.863      100.000
GET     292.863      100.000
[...]
GET     303.103      100.000
GET     319.487      100.000
GET     319.487      100.000
GET     321.535      100.000
GET     321.535      100.000
---
WAIT      0.000      100.000